Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: དེ་ནས་དེའི་ཚེ་ཀླུའི་རྒྱལ་པོ་དུག་མེད་ཅེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a nāga king named Poisonless made offerings to the Bhagavān and uttered this verse:

source: ཉོན་མོངས་འཁོར་བ་རྙེད་པ་ཆེ། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །འཁོར་བའི་དངོས་འདྲ་དེ་བཞིན་གཤེགས། །ཆོས་རྣམས་སྣ་ཚོགས་སྟོན་པར་མཛད། །
en: “In order to serve as medicine for all sentient beings, Who accumulate copious afflictions within cyclic existence, The Tathāgata, who is like the actual substance of cyclic existence, Teaches these various dharmas.”

source: འཁོར་བ་ཉོན་མོངས་པའི་ཞིང་གི་ལས་ཀྱི་ས་འཐོབ་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་དྲུག་པའོ།། །།
en: This concludes the sixth chapter, on the topic of attaining the level of activity of the field of the afflictions of cyclic existence.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་བ།
en: Great Cloud Essence said,

source: ཡེ་ཤེས་ལ་རྨོངས་པའི་སྙིང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་གཟུང་བའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called king of the magical manifestation that apprehends the inconceivable essence of ignorance regarding gnosis.”

source: བདེ་བར་གཉེན་པོར་བྱ་བ་མང་བ་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called happily engaging in many deeds as antidotes.

source: མི་མཉམ་པ་དང་མཉམ་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the magical manifestation that is unequaled.

source: མཚུངས་པ་མེད་པར་འགྲོ་བའི་སྣང་བའི་སྒོར་འཇུག་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called entering the gateway of peerlessly spreading light.

source: གཞུང་ལུགས་གོ་བར་བྱེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called producing an understanding of the scriptural tradition.

source: མཐར་བྱེད་པའི་ཏོག་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called the thought that terminates.#17

source: ཡང་དག་པར་བརྗོད་པའི་འོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called luminosity of correct speech.

source: ཆུ་ལས་ཤིན་ཏུ་འཕགས་པར་དམིགས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called perception that is superior to water.

source: སྙིང་པོ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called stainless essence.

source: ས་འཛིན་འོད་འཕྲོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called light-radiating earth-holder.

source: མངོན་པར་འཕགས་པའི་སྣང་བའི་སྒོ་ཞེས་བྱ་བ་སྟེ་
en: And there is the Dharma gateway called gateway of exalted luminosity.

source: བཅུ་པོ་དེ་དག་ནི་ཡེ་ཤེས་ལ་རྨོངས་པའི་སྙིང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གཟུད་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called king of the magical manifestation that apprehends the inconceivable essence of ignorance regarding gnosis.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་ཕྲེང་མཛེས་ཅན་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས། ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Beautiful Garland made offerings to the Bhagavān and uttered this verse:

source: སངས་རྒྱས་ཡེ་ཤེས་བསམ་མི་ཁྱབ། །
en: “The Buddha’s gnosis is inconceivable.

source: ཀྱེ་མ་སེམས་ཅན་ཀུན་ཕན་ཕྱིར། །ཡེ་ཤེས་རྨོངས་པ་སྣ་ཚོགས་པ། །དེ་བཞིན་གཤེགས་པ་སྟོན་པ་མཛད། །
en: Ah! For the benefit of all sentient beings, The Tathāgata has taught The various forms of ignorance with respect to gnosis.”

source: ཡེ་ཤེས་ལ་རྨོངས་པ་གཟུད་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བདུན་པའོ།། །།
en: This concludes the seventh chapter, on the topic of apprehending ignorance regarding gnosis.

source: ཡེ་ཤེས་ཟབ་མོ་བརྟན་པ་འཐོབ་པ་ལ་འཇུག་པའི་རྣམ་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called aspects of bringing about the attainment of stable, profound gnosis.”

source: ཤིན་ཏུ་ཡངས་པའི་སྙིང་པོ་བཅུ་ལ་གུས་པར་འཇུག་པ་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called reverently engaging in the ten extensive essences.

source: ནམ་མཁས་བསྲུངས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called guarded by space.

source: དུས་བཟངས་ཟབ་མོ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called entering the profound, auspicious time.

source: ཕྲ་བ་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called delighting in the subtle.

source: རྒྱ་མཚོ་མི་བསྐྱོད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called oceanic immovability.

source: ཡེ་ཤེས་ཀྱི་འོད་འཕྲོ་བའི་འོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called radiant light of gnosis.

source: ངག་གི་རང་བཞིན་གཙང་བ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called engaging in the natural purity of speech.

source: ཉོན་མོངས་པའི་བུད་ཤིང་ཚིག་པ་དྲི་མ་མེད་པ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called engaging in the stainlessness of incinerating the firewood of the afflictions.

source: བློ་གྲོས་བརྟན་པ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called engaging in steadfast intelligence.

source: བློ་གྲོས་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་སྟེ།
en: And there is the Dharma gateway called stainless intelligence.

source: བཅུ་པོ་དེ་དག་ནི་ཡེ་ཤེས་ཟབ་མོ་བརྟན་པ་འཐོབ་པ་ལ་འཇུག་པའི་རྣམ་པའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called aspects of bringing about the attainment of stable, profound gnosis.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་གསེར་ལྟར་གསལ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Shining Like Gold made offerings to the Bhagavān and uttered this verse:

source: གསེར་གྱིས་རབ་བརྒྱན་འདྲ་བའི་དེ་བཞིན་གཤེགས། །ཡེ་ཤེས་མངའ་བས་གསེར་གྱི་རི་བོ་བཞིན། །
en: “As though adorned with gold, the Tathāgata, Endowed with gnosis, is like a golden mountain.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པ་མཛད་སླད་དུ། །ཡེ་ཤེས་ཟབ་མོའི་གཏེར་ནི་སྟོན་པར་མཛད། །
en: To bring benefit to sentient beings, You teach the profound treasure of gnosis.”

source: ཡེ་ཤེས་ཟབ་མོ་བརྟན་པ་འཐོབ་པ་ལ་འཇུག་པའི་རྣམ་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བརྒྱད་པའོ།། །།
en: This concludes the eighth chapter, on the topic of bringing about the attainment of stable, profound gnosis.

source: སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆར་གྱི་རྒྱུན་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་མཛོད་ཅེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called storehouse of inconceivable merit of the flowing rain of the great cloud’s essence.”

source: བྱམས་པ་ལ་དགའ་བའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called storehouse of delighting in loving-kindness.

source: སྙིང་རྗེ་ལ་དགའ་བའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse of delighting in compassion.

source: དགའ་བ་ལ་དགའ་བའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse of delighting in joy.

source: བཏང་སྙོམས་ལ་དགའ་བའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse of delighting in equanimity.

source: བདེན་པས་ཆུ་འབེབས་པའི་ཆུའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse of water showered down by the truth.

source: རྒྱ་མཚོ་ཉའི་འགྲོ་བར་རྒྱུ་བའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse of the circulation of fish in the ocean.

source: ཆོས་ཀྱི་སྒོའི་མིང་དང་ལྡན་པའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse replete with the names of the Dharma gateways.

source: རྒྱུན་གྱི་རྒྱལ་པོའི་ལམ་གྱི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse of the path of the king of streams.

source: གཞུང་ལུགས་ལ་འཇུག་པའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse of engaging with the scriptural tradition.

source: མིང་གི་གསང་ཚིག་གསུམ་གྱི་དཀོན་མཆོག་ལ་འཇུག་པའི་མཛོད་ཅེས་བྱ་བ་སྟེ།
en: And there is the Dharma gateway called storehouse of engaging with the precious jewel of the three secret designations.

source: བཅུ་པོ་དེ་དག་ནི་སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆར་གྱི་རྒྱུན་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called storehouse of inconceivable merit of the flowing rain of the great cloud’s essence.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་ཡེ་ཤེས་ལ་དགའ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Delights in Gnosis made offerings to the Bhagavān and spoke this verse:

source: བཅོམ་ལྡན་སངས་རྒྱས་བསམ་མི་ཁྱབ། །
en: “The Bhagavān, the Buddha, is inconceivable.

source: དེ་བཞིན་གཤེགས་པ་འགག་པ་མེད། །
en: The Tathāgata is unobstructed.

source: ཀྱེ་མ་སེམས་ཅན་སྨན་སླད་དུ། །ཆོས་རྣམས་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: Ah! You teach these various doctrines That serve as medicine for sentient beings.”

source: རྣམ་པར་ཐར་པའི་བསོད་ནམས་ཀྱི་མཛོད་ཀྱི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་དགུ་པའོ།། །།
en: This concludes the ninth chapter, on the topic of the storehouse of merit of liberation.

source: སྤྲིན་ཆེན་པོའི་ཆར་གྱི་རྒྱུན་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་རྣམ་པའི་ལམ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ། །
en: “I beseech the Bhagavān to explain the ten Dharma gateways called path of the aspect of the inconceivable merit of the flowing rain of the great cloud.”

source: ཆར་གྱི་དུས་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called season of rain.

source: ཆར་གྱི་དྲ་བའི་རྒྱུན་རིན་པོ་ཆེའི་རེང་བུའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called lone king of the precious flow of the net of rain.

source: ཆར་གྱི་དྲ་བའི་སྙིང་པོའི་ཕྱག་རྒྱའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the seal of the essence of the veil of rain.

source: ཆར་གྱི་དྲི་མ་སེལ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called rain’s cleansing of stains.

source: ཆར་གྱི་དྲ་བ་སྣ་ཚོགས་ཀྱི་ཆུའི་གདུག་པ་སེལ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the various poison-cleansing waters of the veil of rain.

source: ཆར་གྱི་དྲ་བ་བདེ་བསིལ་ངོམས་པར་བྱེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called pleasing, cooling satisfaction produced by the net of rain.

source: ཆར་སྣ་ཚོགས་ལ་དམིགས་པ་ཡང་དག་པའི་སྤྱོད་ཡུལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the domain of the correct perception of various rains.

source: ཆར་སྣ་ཚོགས་ལ་ཡང་དག་པར་ལྟ་བ་དང་ལྷན་ཅིག་སྐྱེས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called coemergence of the correct view of various rains.

source: ཆར་སྣ་ཚོགས་ཀྱི་བསོད་ནམས་ཀྱི་རྣམ་པའི་ཞིང་ལ་དབང་བྱེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called mastery over the field of the aspect of merit of various rains.

source: ཆར་གྱི་དྲ་བ་བདེ་བསིལ་སྨན་གྱི་ཆར་འབེབས་ཀླུའི་རྒྱལ་པོ་ཞེས་བྱ་བ་སྟེ།
en: And there is the Dharma gateway called nāga king who showers down the pleasant, cooling medicinal rain of the veil of rain.

source: བཅུ་པོ་དེ་དག་ནི་སྤྲིན་ཆེན་པོའི་ཆར་གྱི་རྒྱུན་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་རྣམ་པའི་ལམ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called path of the aspect of the inconceivable merit of the flowing rain of the great cloud.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་ནམ་མཁའ་ལ་བསྒྲགས་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: At that time, a devaputra named Thunders throughout Space made offerings to the Bhagavān and uttered these verses:

source: ཁྱོད་ཀྱིས་དེ་རིང་གསང་བ་མང་པོ་རབ་ཏུ་བཤད། །ལྷ་རྣམས་སྟོང་ཕྲག་བྱེ་བ་རབ་ཏུ་གྲོལ་བར་མཛད། །
en: “Today, you have explained many secrets, Bringing thousands of billions of gods to liberation.

source: སེམས་ཅན་མང་པོ་དག་ཀྱང་ཁྱོད་ཀྱིས་གྲོལ་བར་མཛད། །
en: You have also brought a multitude of sentient beings to liberation.

source: རྒ་ནད་བཟློགས་ཕྱིར་མྱ་ངན་འདས་པ་ཡང་དག་རྟོགས། །
en: To turn back old age and illness, you have truly realized nirvāṇa.

source: ཁྱོད་ནི་ལྷ་ཡི་ལྷ་མཆོག་བླ་ན་མེད་པ་ལགས། །
en: “You are the god of gods, supreme and unsurpassed.

source: ཁྱོད་ནི་གསང་བའི་གསང་བ་ཁྱོད་ནི་འཇིག་རྟེན་མགོན། །
en: You are the secret of secrets, the protector of the world.

source: ཆོས་རྣམས་རྣམ་པ་སྣ་ཚོགས་དོན་ཡོད་སྟོན་པ་མཛད། །ཡེ་ཤེས་འོད་འཕྲོ་སྒྲོན་མ་དམ་པ་རྟག་ཏུ་སྣང་། །
en: You meaningfully explain the various aspects of phenomena, And you constantly shine the excellent lamp that radiates the light of gnosis.”

source: བསོད་ནམས་ཀྱི་རྣམ་པ་ཡོངས་སུ་བརྗོད་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་པའོ།། །།
en: This concludes the tenth chapter, on the topic of proclaiming the aspect of merit.

source: སྤྲིན་ཆེན་པོའི་ཚོགས་ནམ་མཁའ་ལས་འབྱུང་ཞིང་འདུ་བའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱས་པར་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called king of the magical manifestation of the mass of great clouds that arises and gathers in space.”

source: རྩ་བ་ནས་སྐྱེ་བའི་རབ་ཏུ་མགུ་བ་ལ་མཁས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called king of skill in the utter delight that arises from the root.

source: རྩ་བའི་རང་བཞིན་ལེགས་པར་མཐོང་ནས་རྟག་ཏུ་རྗོད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called constantly expressing the excellent perception of the fundamental nature.

source: མཉམ་པ་དང་མི་མཉམ་པའི་ཡེ་ཤེས་ཤིན་ཏུ་མཐོང་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the great perception of the unequaled gnosis.

source: བརྟག་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called seal of comprehension.

source: བློ་གྲོས་མི་ཟད་པའི་ཡང་དག་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of perfect inexhaustible intelligence.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called inconceivable abode.

source: ཆགས་པ་མེད་པའི་ནན་ཏན་གྱི་རྣམ་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called aspect of exertion free from desire.

source: རྒྱ་མཚོ་ཟབ་མོའི་དུས་ཤིན་ཏུ་ངེས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the utmost certainty of the deep ocean tide.

source: དུས་ཚིགས་ཡིད་དུ་འོང་བ་ལ་མངོན་པར་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called delight in the pleasant season.

source: ནམ་མཁའ་དང་མཉམ་པའི་ཡེ་ཤེས་ཀྱི་ཆར་སྤྲིན་ཆེན་པོའི་ནམ་མཁའི་མཛོད་ཅེས་བྱ་སྟེ
en: There is the Dharma gateway called space storehouse of the great cloud of the rain of gnosis equal to space.

source: བཅུ་པོ་དེ་དག་ནི་སྤྲིན་ཆེན་པོའི་ཚོགས་ནམ་མཁའ་ལས་འབྱུང་ཞིང་འདུ་བའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called king of the magical manifestation of the mass of great clouds that arises and gathers in space.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་ཚུལ་ལ་མཁས་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Skillful Manner made offerings to the Bhagavān and uttered this verse:

source: གསང་སྲུང་དཔའ་བོ་ཆེན་པོ་སྟེ། དེ་བཞིན་གཤེགས་པ་གསང་བས་བསྲུངས། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །གསང་བ་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: “Great hero who keeps secrets, Tathāgata, guarded by secrets, You teach these various secrets To serve as medicine for sentient beings.”

source: སྤྲིན་ཆེན་པོའི་ཚོགས་ནམ་མཁའ་ལས་འབྱུང་བའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་གཅིག་པའོ།། །།
en: This concludes the eleventh chapter, on the topic of the mass of great clouds that arises in space.

source: སྤྲིན་ཆེན་པོའི་གློག་གི་འོད་སྣང་བའི་སྒོ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ། །
en: “I beseech the Bhagavān to explain the ten Dharma gateways called brilliant lightning of the great cloud.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རབ་ཏུ་འབར་བར་མཛད་དུ་གསོལ། །
en: May the Bhagavān, the Tathāgata, make them blaze forth.”

source: རིན་པོ་ཆེའི་མཛོད་ཀྱི་འོད་ཟེར་གྱི་གློག་གི་འོད་ཅེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called lightning of the light rays of the precious storehouse.

source: ནམ་མཁའ་ལ་བརྩོན་འགྲུས་སྣང་བའི་གློག་གི་འོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called lightning in the sky of the brilliance of resolve.

source: ཤིན་ཏུ་བསྲུང་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called most protected.

source: མཚམས་ཀྱི་དུས་ཚོད་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the seasons.

source: དཔལ་གྱིས་བསྲུངས་པའི་བློ་གྲོས་འདོད་པའི་བློའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the mind that desires the intellect guarded by glory.

source: དྲི་མ་མེད་པའི་གསེར་གྱི་གློག་གི་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the stainless golden lightning.

source: བཻ་དཱུརྱའི་སྙིང་པོའི་བློ་གྲོས་མི་ཟད་པའི་སྣང་བའི་གློག་གི་འོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called lightning of the brilliant inexhaustible intelligence of the essence of beryl.

source: གནས་ལ་མངོན་པར་མོས་པའི་གློག་གི་འོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called lightning of manifest conviction in the abodes.

source: ཡོན་ཏན་གྱི་རྒྱ་མཚོ་ཟབ་མོ་བརྟན་པའི་གློག་གི་འོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called lightning of the constancy of the deep ocean of virtuous qualities.

source: ཡུལ་ཆོམ་དུ་འབེབས་པའི་གློག་གི་འོད་ཅེས་བྱ་བ་སྟེ།
en: There is the Dharma gateway called lightning that strikes continuously over the land.

source: བཅུ་པོ་དེ་དག་ནི་སྤྲིན་ཆེན་པོའི་གློག་གི་འོད་སྣང་བའི་སྒོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called brilliant lightning of the great cloud.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་མངོན་པར་འཚོ་བར་བྱེད་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Manifest Sustenance made offerings to the Bhagavān and paid homage, touching her feet to his head, and uttered this verse:

source: གློག་གི་རྒྱལ་པོ་སྐུ་ཆེ་བ། །ནམ་མཁའ་དང་ནི་མཚུངས་འདྲ་སྟེ། །
en: “King of lightning, the greatness of your body Is equal to space.

source: དེ་བཞིན་གཤེགས་པ་ཐབས་ཀྱི་གཟུགས། །བདག་གིས་ཆུང་ཟད་བརྗོད་མི་ནུས། །
en: I cannot say even the slightest thing About the Tathāgata’s skillful form.”

source: གློག་གི་འོད་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་གཉིས་པའོ།། །།
en: This concludes the twelfth chapter, on the topic of lightning.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པ་དང་བདེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཉི་མའི་འོད་ཟེར་ཆེན་པོ་མཐའ་ཡས་པ་རབ་ཏུ་དགྱེ་བར་གསོལ།
en: “I beseech the Bhagavān to shine forth the infinite great light rays of the sun of buddhahood to serve as medicine for all sentient beings and for the sake of their happiness.

source: སྤྲིན་ཆེན་པོའི་གློག་འགྱུ་བ་དང་ལྡན་པ་ལ་འཇུག་པའི་རྣམ་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: I beseech the Bhagavān to explain the ten Dharma gateways called the aspects of entering the great cloud that flashes with lightning.”

source: རླུང་གི་མཐུ་དང་མཉམ་པའི་ཤུགས་ཀྱི་གློག་གི་འོད་འགྱུ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called king of the lightning flash that is as powerful as the wind’s strength.

source: ཡེ་ཤེས་ཤིན་ཏུ་རྣོ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called extremely sharp gnosis.

source: ཡེ་ཤེས་མངོན་པར་གཏན་ལ་འབེབས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the clear ascertainment of gnosis.

source: ལྷན་ཅིག་འཇུག་པའི་ཤུགས་ཀྱིས་སྒྲ་བསྒྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of resounding through the power of simultaneous arising.

source: རྒྱ་མཚོའི་རླབས་གཡོ་བ་ལ་མཁས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of skill in the fluctuation of ocean waves.

source: ཆོས་འདོད་ཅིང་རབ་ཏུ་བསྲུངས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called desiring and completely protecting the Dharma.

source: ནོར་གྱིས་རྒྱལ་བའི་མཚམས་སྦྱོར་བ་ལ་མཁས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of skill at connecting with the conquerors through wealth.

source: ཆོས་ཀྱི་རྔ་བོ་ཆེ་དུག་གནོན་པའི་སྨན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the medicine that suppresses poison, the great drum of Dharma.

source: ཤིན་ཏུ་མཛེས་པས་སྟོན་པ་སྟོབས་དང་ལྡན་པར་བྱེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called producing the endowment of the strengths of the Teacher through exceptional beauty.

source: མུན་པ་དང་ཆབ་རོམ་ལྟ་བུའི་ཉོན་མོངས་པའི་རྩ་བ་རྣམ་པར་སྒྲོགས་པ་ལ་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་སྟེ།
en: There is the Dharma gateway called king of the magical manifestation that proclaims the roots of the afflictions, which are like darkness or ice.

source: བཅུ་པོ་དེ་དག་ནི་སྤྲིན་ཆེན་པོའི་གློག་འགྱུ་བ་དང་ལྡན་པ་ལ་འཇུག་པའི་རྣམ་པར་འཕྲུལ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called the aspects of entering the great cloud that flashes with lightning.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་ཤུགས་ལྡན་མ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: At that time, a goddess named Forceful made offerings to the Bhagavān and uttered these verses:

source: ང་རྒྱལ་མི་མངའ་བསྙེངས་མི་མངའ། །ཐུགས་རྗེར་ལྡན་ཞིང་སྐྱོན་མི་མངའ། །དཔའ་བོ་ཐབས་ལ་མཁས་པ་སྟེ། །འཇིག་རྟེན་ཀུན་དང་འཐུན་པར་འཇུག །
en: “Without pride and without fear, Endowed with compassion and without fault, The hero skilled in means Brings harmony to all worlds.

source: དེ་རིང་ཁྱོད་ཀྱི་གཟི་བརྗིད་ཀྱིས། །འཇིག་རྟེན་འཐུན་པ་བདག་གིས་བསླབས། །
en: Today, through your majesty, I have learned to be in harmony with the world.

source: བསམ་གྱིས་མི་ཁྱབ་བསམ་ཡས་ལྷ། །དེ་བཞིན་གཤེགས་པ་མཚུངས་མེད་མཚུངས། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ཆོས་རྣམས་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: “Inconceivable, unimaginable god, Incomparable Tathāgata, You teach these various doctrines As medicine for all sentient beings.”

source: སྤྲིན་ཆེན་པོའི་གློག་འགྱུ་བ་དང་ལྡན་ཞིང་མུན་པ་འཇོམས་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་གསུམ་པའོ།། །།
en: This concludes the thirteenth chapter, on the topic of the great cloud that flashes with lightning and overcomes darkness.

source: སྤྲིན་ཆེན་པོའི་གློག་གི་སྒྱུ་འཕྲུལ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called illusory emanation of the lightning of the great cloud.”

source: རྟག་ཏུ་བརྗོད་པ་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called constantly proclaiming.

source: སྤྲིན་ཆེན་པོའི་གློག་གི་སྒྱུ་འཕྲུལ་རྟག་ཏུ་མངོན་པར་སྲུང་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called constantly guarding the illusory emanation of the lightning of the great cloud.

source: རྟག་ཏུ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called constantly joyful.

source: རྟག་ཏུ་མངོན་པར་འདོད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called constantly wishful.

source: མེ་ལ་མངོན་པར་རྩེ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called playing in fire.

source: སྐྱེ་གནས་ཐམས་ཅད་དུ་མངོན་པར་འཇུག་པ་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called delighting in entering all birthplaces.

source: རྙེད་པ་དང་བཅས་པའི་འགྲོ་བ་ལ་རབ་ཏུ་མགུ་བ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called rejoicing in all migrating beings with material gains.

source: ཆུ་འབྱེད་དཀར་མོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called white swan.

source: འོད་འཕྲོ་བའི་རྒྱལ་པོ་མངོན་དུ་བྱེད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called displaying the king of radiant light.

source: རྟག་ཏུ་མངོན་པར་འཕགས་པ་མངོན་པར་རྒྱས་པའི་ཕྲེང་བ་བརྒྱུས་པ་ཞེས་བྱ་བ་སྟེ།
en: There is the Dharma gateway called threading the vast garland of constant superiority.

source: བཅུ་པོ་དེ་དག་ནི་སྤྲིན་ཆེན་པོའི་གློག་གི་སྒྱུ་འཕྲུལ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called illusory emanation of the lightning of the great cloud.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་སྤྲིན་གྱི་ཆུང་མ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ནས། ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Wife of Clouds made great offerings to the Bhagavān and uttered this verse:

source: ཀྱེ་མ་བཅོམ་ལྡན་སངས་རྒྱས་ཀྱི། །ཡུལ་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ། །
en: “Ah! The bhagavān Buddha’s domain Is inconceivable.

source: སྒྱུ་འཕྲུལ་རྒྱལ་པོ་དེ་བཞིན་གཤེགས། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །སྒྱུ་འཕྲུལ་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: Tathāgata, king of illusory emanation, You teach these various illusory emanations As medicine for sentient beings.”

source: སྤྲིན་ཆེན་པོའི་གློག་གི་སྒྱུ་འཕྲུལ་གྱི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་བཞི་པའོ།། །།
en: This concludes the fourteenth chapter, on the topic of the illusory emanation of the lightning of the great cloud.
